# PropertySetDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySetDescription Property
ParameterTypeId Class See Also
---
"Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySetDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySetDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySetDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace